src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Управленческий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>CatalogRef.Скидка</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЗначениеСкидки(Ссылка)
	Возврат Ссылка.ПроцентСкидки;
КонецФункции

&НаКлиенте
Функция ПолучитьТекущиеДанные()
	Возврат Элементы.Товары.ТекущиеДанные;
КонецФункции

&НаКлиенте
Процедура РасчетСуммы()
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	ЗначениеСкидки = ПолучитьЗначениеСкидки(СтрокаРасчета.Скидка);
	// ЗначениеСкидки = СтрокаРасчета.Скидка.ПроцентСкидки;
	СтрокаРасчета.Сумма 		= СтрокаРасчета.Цена * СтрокаРасчета.Количество;
	СтрокаРасчета.СуммаСкидки 	= СтрокаРасчета.Сумма * ЗначениеСкидки * 0.01;
	СтрокаРасчета.Всего 		= СтрокаРасчета.Сумма - СтрокаРасчета.СуммаСкидки; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	РасчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекДанные = ПолучитьТекущиеДанные();
	ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
	
	Скидка = 10;
	
	ТекДанные.СуммаСкидки = Скидка * 0.01 * ТекДанные.Сумма;
	ТекДанные.Всего = ТекДанные.Сумма + ТекДанные.СуммаСкидки;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаСкидкиПриИзменении(Элемент)
	Скидка = 10;
	ТекДанные = ПолучитьТекущиеДанные();
	
	ТекДанные.Цена = ТекДанные.СуммаСкидки / ТекДанные.Количество * Скидка;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	ТекДанные.Всего = ТекДанные.Сумма + ТекДанные.СуммаСкидки;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВсегоПриИзменении(Элемент)
	Скидка = 10;
	ТекДанные = ПолучитьТекущиеДанные();
	
	ТекДанные.СуммаСкидки = ТекДанные.Всего / (Скидка + 100) * Скидка;
	
	ТекДанные.Сумма = (ТекДанные.Всего - ТекДанные.СуммаСкидки);
	ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
	
			
	
КонецПроцедуры
